Revit.Elements.ImportInstance.#ctor(System.String,Autodesk.Revit.DB.XYZ,Revit.Elements.Views.View)
Constructor for ImportInstance
satPath:
translation:
view:

Revit.Elements.ImportInstance.InitImportInstance(System.String,Revit.Elements.Views.View,Autodesk.Revit.DB.XYZ)
Initialize an ImportInstance element
satPath:
translation:
view:

Revit.Elements.ImportInstance.ByGeometriesAndView(Autodesk.DesignScript.Geometry.Geometry[],Revit.Elements.Views.View)
Import a collection of Geometry (Solid, Curve, Surface, etc) into Revit views as an ImportInstance.  This variant is much faster than
ImportInstance.ByGeometry as it uses a batch method.
geometries: A collection of Geometry
view: The view into which the ImportInstance will be imported.
Returns:

Revit.Elements.ImportInstance.ByGeometryAndView(Autodesk.DesignScript.Geometry.Geometry,Revit.Elements.Views.View)
Import a collection of Geometry (Solid, Curve, Surface, etc) into Revit views as an ImportInstance.
geometry: A single piece of geometry
view: The view into which the ImportInstance will be imported.
Returns:

Revit.Elements.ImportInstance.CreateSATFile(Autodesk.DesignScript.Geometry.Geometry[],Autodesk.DesignScript.Geometry.Vector@)
Create a SAT and export it to a temporary file.
geometries:
translation:
Returns: